Tekla.Structures.Drawing.PreferredTextPlacingTypes
The PreferredTextPlacingTypes class contains the available preferred text placing types.
These are allowed to be used for texts.

Tekla.Structures.Drawing.PreferredTextPlacingTypes.PointPlacingType
The object is placed at one point (the insertion point) without any additional placing options.
Returns: A new point placing type instance.

Tekla.Structures.Drawing.PreferredTextPlacingTypes.LeaderLinePlacingType
The object is placed with a leader line.
Returns: A new leader line placing type instance.

Tekla.Structures.Drawing.PreferredTextPlacingTypes.AlongLinePlacingType
The object is placed using the along line placing.
Returns: A new along line placing type instance.

Tekla.Structures.Drawing.PreferredTextPlacingTypes.BaseLinePlacingType
The object is placed using the base line placing.
Returns: A new base line placing type instance.

Tekla.Structures.Drawing.PreferredTextPlacingTypes.BaseLineWithArrowAtStartPointPlacingType
The object is placed using the base line placing.
The line is drawn and will have an arrow at the start point.
Returns: A new base line with arrow at start point placing type instance.

Tekla.Structures.Drawing.PreferredTextPlacingTypes.BaseLineWithArrowAtEndPointPlacingType
The object is placed using the base line placing.
The line is drawn and will have an arrow at the end point.
Returns: A new base line with arrow at end point placing type instance.